Revit 2027 API
SphericalLightDistribution Constructor
 Creates a spherical light distribution object.
Namespace: Autodesk.Revit.DB.Lighting
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public SphericalLightDistribution()
Public Sub New
public:
SphericalLightDistribution()
new : unit -> SphericalLightDistribution
See Also
Reference
SphericalLightDistribution Class
SphericalLightDistribution Overload
Autodesk.Revit.DB.Lighting Namespace